# Yandex 100 SQL Project

<b> Task Description: </b>
    
he coronavirus took the entire world by surprise, changing everyone's daily routine. City dwellers no longer spent their free time outside, going to cafes and malls; more people were home, reading books. That attracted the attention of startups that rushed to develop new apps for book lovers.


You've been given a database of one of the services competing in this market. It contains data on books, publishers, authors, and customer ratings and reviews of books. This information will be used to generate a value proposition for a new product.

<b> Goal: </b> 

- Find the number of books released after January 1, 2000.
- Find the number of user reviews and the average rating for each book.
- Identify the publisher that has released the greatest number of books with more than 50 pages (this will help you exclude brochures and similar publications from your analysis).
- Identify the author with the highest average book rating: look only at books with at least 50 ratings.
- Find the average number of text reviews among users who rated more than 50 books.

====================================================================================

<b> Connecting to the database </b>

In [14]:
!pip install psycopg2-binary

Requirement already satisfied: psycopg2-binary in /anaconda3/lib/python3.6/site-packages (2.8.6)
WARNING: You are using pip version 20.3.3; however, version 21.0.1 is available.
You should consider upgrading via the '/anaconda3/bin/python -m pip install --upgrade pip' command.

In [15]:
# import libraries
import pandas as pd
from sqlalchemy import create_engine


db_config = {'user': 'praktikum_student',         # user name
             'pwd': 'Sdf4$2;d-d30pp', # password
             'host': 'rc1b-wcoijxj3yxfsf3fs.mdb.yandexcloud.net',
             'port': 6432,              # connection port
             'db': 'data-analyst-final-project-db'}          # the name of the data base

connection_string = 'postgresql://{}:{}@{}:{}/{}'.format(db_config['user'],
                                                                     db_config['pwd'],
                                                                       db_config['host'],
                                                                       db_config['port'],
                                                                       db_config['db'])

engine = create_engine(connection_string, connect_args={'sslmode':'require'})

====================================================================================

<b> print 10 rows of each db </b>

In [31]:
query = '''SELECT * 
           FROM books
           LIMIT 5
           
           '''
pd.io.sql.read_sql(query, con = engine)

,book_id,author_id,title,num_pages,publication_date,publisher_id
0,1,546,'Salem's Lot,594,2005-11-01,93
1,2,465,1 000 Places to See Before You Die,992,2003-05-22,336
2,3,407,13 Little Blue Envelopes (Little Blue Envelope...,322,2010-12-21,135
3,4,82,1491: New Revelations of the Americas Before C...,541,2006-10-10,309
4,5,125,1776,386,2006-07-04,268

In [29]:
query = '''SELECT * 
           FROM ratings
           LIMIT 5
           
           '''
pd.io.sql.read_sql(query, con = engine)

   rating_id  book_id       username  rating
0          1        1     ryanfranco       4
1          2        1  grantpatricia       2
2          3        1   brandtandrea       5
3          4        2       lorichen       3
4          5        2    mariokeller       2

In [30]:
query = '''SELECT * 
           FROM reviews
           LIMIT 5
           
           '''
pd.io.sql.read_sql(query, con = engine)

,review_id,book_id,username,text
0,1,1,brandtandrea,Mention society tell send professor analysis. ...
1,2,1,ryanfranco,Foot glass pretty audience hit themselves. Amo...
2,3,2,lorichen,Listen treat keep worry. Miss husband tax but ...
3,4,3,johnsonamanda,Finally month interesting blue could nature cu...
4,5,3,scotttamara,Nation purpose heavy give wait song will. List...

====================================================================================

<b> - Find the number of books released after January 1, 2000. </b>

In [17]:
query = '''
        SELECT count (book_id) as bks_cnt
        FROM books
        where publication_date > '2000-01-01'
'''
pd.io.sql.read_sql(query, con = engine)

   bks_cnt
0      819

* 819 books were released after Janauary 01, 2000.

====================================================================================

<b> - Find the number of user reviews and the average rating for each book. </b>

In [18]:
# books - main table
# rating, reviews - look up tables

In [19]:
##### Method 1 - use join method

In [20]:
query = '''
            SELECT  books.title,
                    books.book_id,
                    count(reviews.review_id) as reviews_cnt,
                    cast(avg(ratings.rating) as decimal(10,2)) as avg_rating
            FROM books
            JOIN reviews
            on reviews.book_id = books.book_id 
            JOIN ratings
            on ratings.book_id = books.book_id
            group by books.book_id

'''
pd.io.sql.read_sql(query, con = engine)

,title,book_id,reviews_cnt,avg_rating
0,The Body in the Library (Miss Marple #3),652,4,4.50
1,Galápagos,273,4,4.50
2,A Tree Grows in Brooklyn,51,60,4.25
3,Undaunted Courage: The Pioneering First Missio...,951,4,4.00
4,The Prophet,839,28,4.29
...,...,...,...,...
989,Alice in Wonderland,64,52,4.23
990,A Woman of Substance (Emma Harte Saga #1),55,4,5.00
991,Christine,148,21,3.43
992,The Magicians' Guild (Black Magician Trilogy #1),790,4,3.50
993,The Plot Against America,828,4,3.00

In [21]:
##### Method 2: use parent-child relationship

In [22]:
query = '''
            SELECT  books.title,
                    books.book_id,
                    count(reviews.review_id) as reviews_cnt,
                    cast(avg(ratings.rating) as decimal(10,2)) as avg_rating
            FROM books, reviews, ratings
            WHERE books.book_id = reviews.book_id AND books.book_id = ratings.book_id
            group by books.book_id

'''
pd.io.sql.read_sql(query, con = engine)

,title,book_id,reviews_cnt,avg_rating
0,The Body in the Library (Miss Marple #3),652,4,4.50
1,Galápagos,273,4,4.50
2,A Tree Grows in Brooklyn,51,60,4.25
3,Undaunted Courage: The Pioneering First Missio...,951,4,4.00
4,The Prophet,839,28,4.29
...,...,...,...,...
989,Alice in Wonderland,64,52,4.23
990,A Woman of Substance (Emma Harte Saga #1),55,4,5.00
991,Christine,148,21,3.43
992,The Magicians' Guild (Black Magician Trilogy #1),790,4,3.50
993,The Plot Against America,828,4,3.00

* mergeing databases can be done using where clause or the join method

====================================================================================

<b> - Identify the publisher that has released the greatest number of books with more than 50 pages (this will help you exclude brochures and similar publications from your analysis). </b>

In [23]:
# select only books with more then 50 pages
# join this with publisher table, left join to the publisher table, by book_id

# from this joined table groupby publisher_id, desc order, limit 1

In [24]:
query = '''
            SELECT publishers.publisher,
                   books_filter.bks_publish_cnt
            
            from publishers, 
                 (SELECT  
                        publisher_id,
                        count(book_id) as bks_publish_cnt
                 FROM books
                 WHERE num_pages > 50
                 GROUP BY publisher_id
                 ORDER BY bks_publish_cnt DESC
                 LIMIT 1) as books_filter
           
             WHERE publishers.publisher_id =  books_filter.publisher_id

'''
pd.io.sql.read_sql(query, con = engine)

       publisher  bks_publish_cnt
0  Penguin Books               42

* Penguin Books is the publisher with the greatest number of books (with more then 50 pages in each) - 42 books in total.

====================================================================================

<b >- Identify the author with the highest average book rating (look only at books with at least 50 ratings). </b>

In [33]:
query = '''
                    SELECT  
                        b.book_id,
                        b.title,
                        a.author,
                        CAST(AVG(r.rating) as decimal (10,2)) as avg_bk_rating
                    FROM
                        books b
                    LEFT JOIN 
                            authors a on a.author_id = b.author_id
                    LEFT JOIN 
                            ratings r on r.book_id = b.book_id
                    
                    GROUP BY b.book_id, a.author
                    HAVING COUNT(DISTINCT r.rating_id) > 50
                    ORDER BY avg_bk_rating DESC
                    LIMIT 1

'''
pd.io.sql.read_sql(query, con = engine)

# questions - when to use having and when to use where

,book_id,title,author,avg_bk_rating
0,302,Harry Potter and the Prisoner of Azkaban (Harr...,J.K. Rowling/Mary GrandPré,4.41

* The auther with the highest average book rating are J.K Rowling with the book "Harry Potter and the Prisoner of Azkaban", which has an average rating of 4.41

====================================================================================

<b> - Find the average number of text reviews among users who rated more than 50 books. </b>

In [26]:
query = '''         
           SELECT CAST(AVG(users_text_cnt.text_cnt) as decimal(10,2)) as avg_text_cnt
           FROM(
               
                SELECT top_users.username, 
                       COUNT(rev.text) as text_cnt
                FROM( 
                         
                      SELECT r.username           
                      FROM ratings r
                      GROUP BY r.username
                      HAVING COUNT(r.rating) > 50) as top_users
                LEFT JOIN reviews rev on rev.username = top_users.username
                GROUP BY top_users.username) as users_text_cnt
                
'''
pd.io.sql.read_sql(query, con = engine)

   avg_text_cnt
0         24.33

* The average number of text reviews among users who rated more than 50 books is 24.33